lululu-913/F280049_AC-DC-AC_26competition/controller.c
/*
 * 2025版 ACDC-3DCAC 控制程序：由 TMS320F28069 移植到 TMS320F280049C。
 *
 * 整流电压/电流双环及逆变纯电压环沿用 2025_acdcac.c；
 * 已按当前拓扑删除功率级DC-DC控制，时钟、GPIO、ADC、中断和ePWM初始化
 * 参考原 project_280049_ACAC/main.c。
 *
 * 为保持 F28069 控制代码含义，逻辑PWM分配如下：
 *   ePWM1/ePWM2/ePWM3：三相逆变 A/B/C 桥臂；
 *   ePWM4：单相整流左桥臂，上下管分别由ePWM4A/ePWM4B驱动；
 *   ePWM5：单相整流右桥臂，上下管分别由ePWM5A/ePWM5B驱动；
 *   ePWM6：未使用，始终强制输出低电平。
 * 该分配不同于原 F280049 AC-AC 工程的“ePWM1/2前级、ePWM4/5/6后级”分组；
 * 接通功率电路前必须核对PCB门极驱动接线。
 */

#include "F28x_Project.h"                                                   // 包含F28004x寄存器、系统及外设定义
#include "driverlib.h"                                                      // 包含F280049 DriverLib接口
#include "math.h"                                                           // 提供单精度三角函数、平方根和绝对值函数
#include "oled.h"                                                           // 包含OLED显示驱动接口
#include "adc_average.h"                                                    // 提供可复用于任意ADC RESULT的分段平均函数

#define RECTIFIER_ONLY_MODE 1                                               // 临时单整流模式：1关闭逆变控制与ePWM1～3输出
#define BOOTSTRAP_CHARGE_TEST_MODE 0                                        // 已关闭自举充电测试，恢复正常整流ePWM输出

//********** 函数声明 **********//
__interrupt void adcA1ISR(void);                                            // 20kHz ADC中断与全部实时控制算法

void InitADC(void);                                                         // 初始化ADCA、ADCB与ADCC模拟模块
void InitADCSOC(void);                                                      // 配置ADC通道、采样窗、触发源和中断
void Init_KEY(void);                                                        // 配置目标板六个按键输入
char KEY_Scan(char mode);                                                   // 读取六个低电平有效按键
void KEY_Control(int key);                                                  // 根据按键修改模式或参考值
void OLED_output(void);                                                     // 刷新设定值和测量值显示

void InitEPWM(void);                                                        // 冻结时基并统一配置所有ePWM模块
void EPWM1_Init(void);                                                      // 初始化ePWM1
void EPWM2_Init(void);                                                      // 初始化ePWM2
void EPWM3_Init(void);                                                      // 初始化ePWM3及SOCA触发
void EPWM4_Init(void);                                                      // 初始化ePWM4
void EPWM5_Init(void);                                                      // 初始化ePWM5
void EPWM6_Init(void);                                                      // 初始化未使用的ePWM6

void PLL1(float UI);                                                        // SOGI-PLL输入电压锁相计算
void PID1_Init(void);                                                       // 初始化母线电压外环参数
void PID2_Init(void);                                                       // 初始化输入电流PI控制器
void PIDa_Init(void);                                                       // 初始化逆变输出电压控制参数
float PID1_Cal(float u);                                                    // 计算母线电压外环增量
float PID2_Cal(float u);                                                    // 计算输入电流PI控制输出
float PIDa_Cal(float u);                                                    // 计算逆变调制分母增量

static void PWM_ForceAllLow(void);                                          // 通过Trip Zone立即关断全部ePWM输出
static void PWM_TripInverter(void);                                         // 仅通过Trip Zone关断逆变侧ePWM1～3
static void PWM_TripRectifier(void);                                        // 仅通过Trip Zone关断整流侧ePWM4/5
#if BOOTSTRAP_CHARGE_TEST_MODE                                              // 仅诊断模式需要固定下管导通辅助函数
static void PWM_ForceRectifierLowSidesOn(void);                              // 诊断模式强制ePWM4/5高边低、低边高
#endif
#if !RECTIFIER_ONLY_MODE                                                    // 单整流模式暂不声明逆变专用辅助函数
static void PWM_ReleaseInverter(void);                                      // 按预装阶段释放逆变侧ePWM1～3
#endif
#if !BOOTSTRAP_CHARGE_TEST_MODE                                             // 固定门极诊断不需要正常整流PWM释放函数
static void PWM_ReleaseRectifier(void);                                     // 按预装阶段释放整流侧ePWM4/5
#endif
#if !RECTIFIER_ONLY_MODE
static void SVPWM_Calculate(float phase_a, float phase_b, float phase_c,     // 计算保持现有相序和基波幅值的SVPWM三相占空比
                            float modulation_a, float modulation_b,
                            float modulation_c, float *duty_a,
                            float *duty_b, float *duty_c);
static void PhaseBalance_Calculate(float ua_rms, float ub_rms, float uc_rms,// 计算零和、同比例限幅的三相幅值补偿
                                   float *trim_a, float *trim_b,
                                   float *trim_c);
#endif

//********** 按键变量（沿用F280049工程板引脚）**********//
#define KEY_H1          (GpioDataRegs.GPADAT.bit.GPIO27)                    // 读取对应目标板按键GPIO电平
#define KEY_H2          (GpioDataRegs.GPADAT.bit.GPIO25)                    // 读取对应目标板按键GPIO电平
#define KEY_H3          (GpioDataRegs.GPADAT.bit.GPIO17)                    // 读取对应目标板按键GPIO电平
#define KEY_H4          (GpioDataRegs.GPADAT.bit.GPIO26)                    // 读取对应目标板按键GPIO电平
#define KEY_H5          (GpioDataRegs.GPADAT.bit.GPIO16)                    // 读取目标板KEY5对应的GPIO16电平
#define KEY_H6          (GpioDataRegs.GPBDAT.bit.GPIO39)                    // 读取目标板KEY6对应的GPIO39电平

#define KEY1_PRESS  1                                                       // 定义对应按键返回码
#define KEY2_PRESS  2                                                       // 定义对应按键返回码
#define KEY3_PRESS  3                                                       // 定义对应按键返回码
#define KEY4_PRESS  4                                                       // 定义对应按键返回码
#define KEY5_PRESS  5                                                       // 定义KEY5按键返回码
#define KEY6_PRESS  6                                                       // 定义KEY6按键返回码
#define KEY_UNPRESS 0                                                       // 定义无按键返回码
int key = 0;                                                                // 保存当前按键扫描结果
int N_key = 0;                                                              // KEY3～KEY6原500ms扫描分频计数器
int N_freq_key = 0;                                                         // KEY1/KEY2频率调节250ms重复分频计数器

//********** Flash运行段变量 **********//
#ifdef _FLASH                                                               // 仅在Flash构建时启用RAM函数段复制
extern Uint16 RamfuncsLoadStart;                                            // Flash中RAM函数段的装载起始符号
extern Uint16 RamfuncsRunStart;                                             // RAM中RAM函数段的运行起始符号
extern Uint16 RamfuncsLoadSize;                                             // RAM函数段复制长度符号
#endif                                                                      // 结束条件编译

//********** PID数据结构与实例 **********//
typedef struct {                                                            // 定义通用PID参数与运行状态结构体
    float ref;                                                               // 控制器参考值
    float Xin;                                                               // 控制器测量输入值
    float Err;                                                               // 当前控制误差
    float Err_last;                                                          // 上一拍控制误差
    float Kp, Ki;                                                            // 比例和积分系数
    float result;                                                            // 当前控制器输出
    float Integral;                                                          // 积分累加状态
} pidsettings;                                                              // 结束PID结构体定义

pidsettings pid1;                                                           // 母线电压外环控制器
pidsettings pid2;                                                           // 输入电流比例控制器
pidsettings pida;                                                           // 三相逆变输出电压控制器

//********** 基础控制变量 **********//
// F280049系统时钟为100MHz，周期值2500可保持原20kHz开关频率
// 与ADC采样频率，使Ts及所有离散控制器系数继续有效。
#define EPWM_TIMER_TBPRD  2500                                              // 100MHz上下计数时对应20kHz PWM
#define pi 3.1415926f                                                       // 定义单精度圆周率常量
#define OUTPUT_FREQ_MIN_HZ 45U                                              // KEY2允许设置的三相逆变输出频率下限
#define OUTPUT_FREQ_MAX_HZ 505U                                             // KEY1允许设置的三相逆变输出频率上限
#define OUTPUT_FREQ_STEP_HZ 1U                                              // KEY1/KEY2每次把三相逆变输出频率调整1Hz
#define FREQ_KEY_REPEAT_ISR_DIV 5000                                        // KEY1/KEY2按20kHz ISR分频，实现250ms长按重复
#define GENERAL_KEY_SCAN_ISR_DIV 10000                                      // KEY3～KEY6保持原500ms扫描与重复周期
#define INPUT_CURRENT_PK_MAX 6.00f                                          // 满功率时限制整流输入电流参考峰值为6.00A
#define INPUT_OVERCURRENT_LIMIT 9.0f                                        // 设置整流输入瞬时软件过流保护阈值为9A
#define BUS_OVERVOLTAGE_LIMIT 70.0f                                         // 可调母线最高65V以上保留5V瞬时软件过压裕量
#define BUS_OVERVOLTAGE_CONFIRM_SAMPLES 40U                                 // 20kHz下连续超压2ms才确认F2，滤除单次采样尖峰
#define ADC_AVERAGE_WINDOW_SAMPLES 6000U                                    // ADC原始结果平均窗口，20kHz下对应300ms
#define BUS_CURRENT_SLEW_UP_STEP 0.010f                                     // 每10ms允许外环电流幅值增加0.010A，实现约1.0A/s软启动
#define BUS_CURRENT_SLEW_DOWN_STEP 0.020f                                   // 每10ms允许外环电流幅值减小0.020A，实现约2.0A/s快速降流
#define BUS_CONTROL_MIN_VOLTAGE 5.0f                                        // 母线电压归一化分母下限，避免启动时除数过小
#define CURRENT_CTRL_VOLTAGE_LIMIT 15.0f                                    // 限制电流环电感补偿电压，抑制占空比突变
#define RECTIFIER_CURRENT_KP 6.0f                                           // 降低输入电流环比例增益以减小瞬时补偿冲击
#define RECTIFIER_CURRENT_KI 0.005f                                         // 同比例降低输入电流环积分增益
#define RECTIFIER_CURRENT_INTEGRAL_LIMIT 30.0f                              // 积分状态限幅，对应最大正负0.15V积分补偿
#define RECTIFIER_FEEDFORWARD_GAIN 0.90f                                    // 采用0.9倍输入电压前馈减轻电流环调节负担
#define RECTIFIER_MODULATION_LIMIT 0.95f                                    // 将单极性调制量Di限制在正负0.95以内
#define BUS_REF_HEADROOM_VOLTAGE 4.0f                                       // 55V母线比36Vac输入峰值保留约4.1V升压裕量
#define BUS_REF_MIN_VOLTAGE 55.0f                                           // KEY5允许设置的母线目标电压下限
#define BUS_REF_MAX_VOLTAGE 65.0f                                           // KEY4允许设置的母线目标电压上限，距70V保护5V
#define BUS_REF_STEP_VOLTAGE 0.5f                                           // KEY4/KEY5每次调整母线目标0.5V
#define INVERTER_SOFT_GAIN_UP_STEP 0.02f                                    // 每10ms增加0.02，约0.5s完成逆变软启动
#define INVERTER_SOFT_GAIN_DOWN_STEP 0.05f                                  // 每10ms减小0.05，约0.2s完成逆变软关断
#define OUTPUT_COMMON_IIR_ALPHA 0.00624f                                    // 20kHz下约20Hz公共三相电压平方滤波
#define OUTPUT_PHASE_IIR_ALPHA 0.000628f                                    // 20kHz下约2Hz单相电压平方滤波，抑制100Hz分量
#define BUS_FEEDFORWARD_IIR_ALPHA 0.086f                                    // 20kHz下约300Hz母线前馈滤波，跟踪100Hz纹波
#define BUS_FEEDFORWARD_GAIN_MIN 0.85f                                      // 母线前馈最小增益，限制采样异常造成的突降
#define BUS_FEEDFORWARD_GAIN_MAX 1.15f                                      // 母线前馈最大增益，限制欠压时调制度突升
#define INVERTER_MODULATION_LIMIT 0.56f                                     // SVPWM公共调制度限幅，含1%平衡补偿仍在线性区
#define PHASE_BALANCE_KP 0.01f                                              // 每相有效值误差1V对应1%幅值补偿
#define PHASE_BALANCE_TRIM_LIMIT 0.01f                                      // 每相独立补偿限制在正负1%
#define PHASE_BALANCE_ENABLE_GAIN 0.95f                                     // 软启动达到95%后才允许相间平衡控制
#define PHASE_BALANCE_SETTLE_WINDOWS 50U                                    // 满幅后等待50个10ms窗口再启用，即500ms
#define OLED_REFRESH_DIVIDER 1000                                           // 20kHz中断分频1000次，每50ms请求刷新一行OLED

float U_REF = 36.0f;                                                        // 单整流输入交流额定有效值为36V
volatile float U_BUS_REF = 55.0f;                                           // 单整流输出直流母线目标电压为55V
volatile float U_OUT_REF = 17.3205f;                                        // 三相相电压目标为17.3205Vrms，对应线电压30Vrms
volatile Uint16 output_freq_hz = 50U;                                       // 三相逆变输出频率命令，KEY1/KEY2在45～505Hz内调节

