lululu-913/F280049_AC-DC-AC_26competition/controller.c
        bus_feedforward_gain = U_BUS_REF / U_bus_ff;                        // 母线升高时主动减小调制度，降低时主动增大调制度
        if(bus_feedforward_gain > BUS_FEEDFORWARD_GAIN_MAX)                 // 限制欠压或采样扰动造成的前馈突增
            bus_feedforward_gain = BUS_FEEDFORWARD_GAIN_MAX;
        else if(bus_feedforward_gain < BUS_FEEDFORWARD_GAIN_MIN)            // 限制母线过高时调制度突降
            bus_feedforward_gain = BUS_FEEDFORWARD_GAIN_MIN;
        inverter_modulation = (inverter_soft_gain / M) * bus_feedforward_gain;// 总电压环、软启动和快速母线前馈串联
        if(inverter_modulation > INVERTER_MODULATION_LIMIT)                 // 保证叠加1%分相补偿后仍处于SVPWM线性区
            inverter_modulation = INVERTER_MODULATION_LIMIT;
        else if(inverter_modulation < 0.0f)
            inverter_modulation = 0.0f;
        modulation_a = inverter_modulation * (1.0f + phase_trim_a);         // A相叠加独立幅值补偿
        modulation_b = inverter_modulation * (1.0f + phase_trim_b);         // B相叠加独立幅值补偿
        modulation_c = inverter_modulation * (1.0f + phase_trim_c);         // C相叠加独立幅值补偿
        // 按三相独立调制度注入同一个SVPWM零序共模分量
        SVPWM_Calculate(theta_a, theta_b, theta_c, modulation_a,
                        modulation_b, modulation_c, &Da, &Db, &Dc);
        EPwm1Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Da);           // 将SVPWM A相占空比转换为中心对齐比较值
        EPwm2Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Db);           // 将SVPWM B相占空比转换为中心对齐比较值
        EPwm3Regs.CMPA.bit.CMPA = (Uint16)(EPWM_TIMER_TBPRD * Dc);           // 将SVPWM C相占空比转换为中心对齐比较值

        N_c2++;                                                             // 保留10ms慢速控制与软启动调度节拍
        if(N_c2 >= N)                                                       // 每200个20kHz采样点更新一次慢速控制状态
        {
            N_c2 = 0;                                                       // 清零逆变统计窗口计数
            U_out_rms = sqrtf(output_common_sq_f);                          // 公共电压环使用快速三相平方IIR的有效值
            U_oa_rms = sqrtf(output_phase_a_sq_f);                          // 分相补偿使用慢速A相有效值
            U_ob_rms = sqrtf(output_phase_b_sq_f);                          // 分相补偿使用慢速B相有效值
            U_oc_rms = sqrtf(output_phase_c_sq_f);                          // 分相补偿使用慢速C相有效值
            U_phase_avg = (U_oa_rms + U_ob_rms + U_oc_rms) * 0.3333333f;    // 保存三相平均值供在线观察
            if(inverter_soft_stop_active != 0)                              // KEY6关闭请求逆变软关断
            {
                inverter_soft_gain -= INVERTER_SOFT_GAIN_DOWN_STEP;         // 每10ms降低0.05输出幅值系数
                if(inverter_soft_gain < 0.0f) inverter_soft_gain = 0.0f;    // 防止软关断系数变为负数
            }
            else if(inverter_enable != 0)                                   // KEY6仍保持逆变运行请求
            {
                inverter_soft_gain += INVERTER_SOFT_GAIN_UP_STEP;           // 每10ms增加0.02输出幅值系数
                if(inverter_soft_gain > 1.0f) inverter_soft_gain = 1.0f;    // 正常运行幅值系数最大为1
            }

            pida.ref = U_OUT_REF * inverter_soft_gain;                      // 电压环目标与软启停幅值同步变化以避免相互对抗
            M += PIDa_Cal(U_out_rms);                                       // 保留原逆变电压环对调制分母M的增量调节
            if(M >= 8) M = 8;                                               // 保留原调制分母上限
            if(M <= 1.8f) M = 1.8f;                                         // SVPWM下限保留约1.9%最小占空比裕量

            if((inverter_pwm_start_stage == 3) &&                           // 仅在PWM已正常释放且软启动基本完成时启用平衡环
               (inverter_soft_gain >= PHASE_BALANCE_ENABLE_GAIN) &&
               (inverter_soft_stop_active == 0))
            {
                if(phase_balance_settle_windows < PHASE_BALANCE_SETTLE_WINDOWS)
                    phase_balance_settle_windows++;
                if(phase_balance_settle_windows >= PHASE_BALANCE_SETTLE_WINDOWS)
                {
                    PhaseBalance_Calculate(U_oa_rms, U_ob_rms, U_oc_rms,    // 计算下一控制周期使用的零和三相补偿
                                           &phase_trim_a, &phase_trim_b,
                                           &phase_trim_c);
                }
                else
                {
                    phase_trim_a = 0.0f;
                    phase_trim_b = 0.0f;
                    phase_trim_c = 0.0f;
                }
            }
            else
            {
                phase_balance_settle_windows = 0U;                          // 软启动或软关断期间禁用独立补偿
                phase_trim_a = 0.0f;
                phase_trim_b = 0.0f;
                phase_trim_c = 0.0f;
            }

            if((inverter_soft_stop_active != 0) &&                          // 软关断过程已经把幅值降至零
               (inverter_soft_gain <= 0.0f))
            {
                PWM_TripInverter();                                         // 零幅值后再Trip ePWM1～3完成软关断
                inverter_pwm_start_stage = 0;                               // 下次运行必须重新完成CMPA预装
                inverter_soft_stop_active = 0;                              // 结束本次软关断状态
            }
        }

        if(inverter_pwm_start_stage != 0) PWM_ReleaseInverter();            // 独立完成ePWM1～3预装等待和Trip释放
    }
    else                                                                    // 逆变没有运行或已经被保护关断
    {
        PWM_TripInverter();                                                 // 保持ePWM1～3的One-Shot Trip锁存
        EPwm1Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变A相比较值影子寄存器
        EPwm2Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变B相比较值影子寄存器
        EPwm3Regs.CMPA.bit.CMPA = 0;                                        // 清零逆变C相比较值影子寄存器
        N_c2 = 0;                                                           // 清零逆变输出统计窗口计数
        U_out_rms = 0.0f;                                                   // 关断状态下清零逆变窗口输出值
        U_oa_rms = 0.0f;                                                    // 清零三相慢速有效值，防止下次启动沿用旧状态
        U_ob_rms = 0.0f;
        U_oc_rms = 0.0f;
        U_phase_avg = 0.0f;
        output_common_sq_f = 0.0f;                                          // 清零公共及分相IIR状态
        output_phase_a_sq_f = 0.0f;
        output_phase_b_sq_f = 0.0f;
        output_phase_c_sq_f = 0.0f;
        phase_balance_settle_windows = 0U;                                  // 下次满幅后重新等待500ms
        phase_trim_a = 0.0f;                                                // 关断时禁止残留相间补偿
        phase_trim_b = 0.0f;
        phase_trim_c = 0.0f;
        inverter_modulation = 0.0f;
        modulation_a = 0.0f;
        modulation_b = 0.0f;
        modulation_c = 0.0f;
        theta_a = 0.0f;                                                     // 把A相输出相位复位到零点
        theta_b = 2.0944f;                                                  // 把B相输出相位复位到超前120度
        theta_c = 4.1888f;                                                  // 把C相输出相位复位到滞后120度的等效正角
    }
#else                                                                       // 单整流模式只保留逆变侧硬件安全关断
    PWM_TripInverter();                                                     // 每拍锁存关断ePWM1～3，KEY6不产生逆变输出
    inverter_pwm_start_stage = 0;                                           // 禁止逆变启动状态机进入预装或释放阶段
    inverter_soft_stop_active = 0;                                          // 禁止遗留软关断状态
    inverter_soft_gain = 0.0f;                                              // 逆变调制幅值固定为零
    EPwm1Regs.CMPA.bit.CMPA = 0;                                            // 清零逆变A相比较值影子寄存器
    EPwm2Regs.CMPA.bit.CMPA = 0;                                            // 清零逆变B相比较值影子寄存器
    EPwm3Regs.CMPA.bit.CMPA = 0;                                            // 清零逆变C相比较值影子寄存器
#endif                                                                      // 结束逆变算法临时屏蔽

#if !BOOTSTRAP_CHARGE_TEST_MODE                                             // 固定门极诊断时禁止按键改变任何功率级状态
    N_freq_key++;                                                           // 独立累加KEY1/KEY2频率调节分频计数
    if(N_freq_key >= FREQ_KEY_REPEAT_ISR_DIV)                               // 每5000个20kHz控制周期即250ms处理一次频率按键
    {
        N_freq_key = 0;                                                     // 清零频率按键重复分频计数
        if(KEY_H1 == 0) KEY_Control(KEY1_PRESS);                            // KEY1按下或长按时把频率增加1Hz
        else if(KEY_H2 == 0) KEY_Control(KEY2_PRESS);                       // KEY2按下或长按时把频率减小1Hz
    }

    N_key++;                                                                // 独立累加KEY3～KEY6通用按键扫描分频计数
    if(N_key >= GENERAL_KEY_SCAN_ISR_DIV)                                   // 保持原每10000个控制周期即500ms扫描一次
    {
        N_key = 0;                                                          // 清零按键扫描分频计数
        key = KEY_Scan(0);                                                  // 扫描目标板KEY3～KEY6
        KEY_Control(key);                                                   // 执行按键对应的模式或设定值操作
    }
#endif                                                                      // 结束诊断模式下的按键处理屏蔽
    tag = ((rectifier_enable != 0) ? 2 : 0) + ((inverter_enable != 0) ? 1 : 0); // 实时组合独立模式状态供在线观察

    N_oled++;                                                               // 累加OLED刷新分频计数
    if(N_oled >= OLED_REFRESH_DIVIDER)                                      // 每1000个控制周期即50ms请求刷新一行
    {
        N_oled = 0;                                                         // 清零OLED刷新分频计数器
        oled_refresh_request = 1;                                           // 通知主循环执行一次单行OLED刷新
    }

