lululu-913/F280049_AC-DC-AC_26competition/controller.c
    av = ADC_Average_Update(&adcb_result0_average, AdcbResultRegs.ADCRESULT0, ADC_AVERAGE_WINDOW_SAMPLES); // 更新ADCB0原始值6000点平均

#if BOOTSTRAP_CHARGE_TEST_MODE                                              // 每拍维持固定门极状态，防止正常整流逻辑覆盖
    if((system_fault == 0) && (rectifier_fault == 0))                        // 过流、过压或全局故障仍允许Trip关断两只下管
        PWM_ForceRectifierLowSidesOn();                                     // 两块整流半桥固定HI=0、LI=1
#endif

    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                                  // 清除ADCA INT1标志以允许下一次中断
    if(AdcaRegs.ADCINTOVF.bit.ADCINT1 == 1)                                 // 检查控制ISR是否发生ADC中断溢出
    {
        AdcaRegs.ADCINTOVFCLR.bit.ADCINT1 = 1;                              // 清除ADCA INT1溢出标志
        AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                              // 清除ADCA INT1标志以允许下一次中断
    }
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;                                 // 应答PIE第1组以接收下一次ADC中断
}

//******************* 锁相环 *******************//
void PLL1(float UI)                                                         // SOGI-PLL输入电压锁相计算
{
    x = UI - Ua;                                                            // 计算输入电压与SOGI α轴输出之差
    Ua = Ua + (x * k - Ub) * W0 * Ts;                                       // 按已核对差分方程更新SOGI α轴分量
    Ub = Ub + Ua * W0 * Ts;                                                 // 按已核对差分方程更新SOGI β轴分量
    Ud = cosf(theta) * Ua + sinf(theta) * Ub;                               // 将αβ分量变换到同步旋转d轴
    Uq = cosf(theta) * Ub - sinf(theta) * Ua;                               // 将αβ分量变换到同步旋转q轴
    err = 0.0f - Uq;                                                        // 以Uq趋近零作为PLL锁相目标
    result = kp * err + ki * (err - last_err);                              // 按已核对写法计算本拍角频率修正量
    last_err = err;                                                         // 保存本拍误差供下一拍差分使用
    W1 -= result;                                                           // 累加修正PLL估算角频率
    if(W1 >= 115.0f * pi) W1 = 115.0f * pi;                                // 将PLL最高频率限制为57.5Hz
    if(W1 <= 85.0f * pi) W1 = 85.0f * pi;                                  // 将PLL最低频率限制为42.5Hz
    W1_pi = W1 / (2.0f * pi);                                               // 把估算角频率换算成Hz供在线观察
    theta += W1 * Ts;                                                       // 使用当前估算角频率推进PLL相位
    if(theta >= 2.0f * pi) theta -= 2.0f * pi;                              // 相位超过一周时回绕到0～2π
    else if(theta <= 0.0f) theta += 2.0f * pi;                              // 相位为负或零时按已核对写法执行回卷
}

//******************* PID1：母线电压外环 *******************//
void PID1_Init(void)                                                        // 初始化母线电压外环参数
{
    pid1.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pid1.ref = U_BUS_REF;                                                   // 初始化母线电压外环参考值
    pid1.Err = 0;                                                           // 计算或清零当前控制误差
    pid1.Err_last = 0;                                                      // 保存或清零上一拍误差
    pid1.Kp = 0.05f;                                                        // 仿照单极性程序设置母线电压外环比例系数
    pid1.Ki = 0.001f;                                                       // 仿照单极性程序设置母线电压外环积分系数
    pid1.result = 0;                                                        // 计算或清零控制器当前输出
}

float PID1_Cal(float u)                                                     // 计算母线电压外环增量
{
    pid1.Xin = u;                                                           // 初始化或更新控制器测量输入
    pid1.Err = pid1.ref - pid1.Xin;                                         // 母线欠压时产生正误差并提高输入电流幅值
    pid1.result = pid1.Kp * (pid1.Err - pid1.Err_last) + pid1.Ki * pid1.Err; // 计算或清零控制器当前输出
    pid1.Err_last = pid1.Err;                                               // 保存或清零上一拍误差
    return pid1.result;                                                     // 返回母线电压外环增量
}

//******************* PID2：输入电流PI控制器 *******************//
void PID2_Init(void)                                                        // 初始化输入电流PI控制参数
{
    pid2.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pid2.ref = 0;                                                           // 初始化控制器参考值
    pid2.Err = 0;                                                           // 计算或清零当前控制误差
    pid2.Kp = RECTIFIER_CURRENT_KP;                                         // 使用整流输入电流比例增益
    pid2.Ki = RECTIFIER_CURRENT_KI;                                         // 使用保守积分增益缓慢消除稳态误差
    pid2.Integral = 0;                                                      // 清零输入电流积分状态
    pid2.result = 0;                                                        // 计算或清零控制器当前输出
}

float PID2_Cal(float u)                                                     // 计算输入电流PI控制输出
{
    pid2.Xin = u;                                                           // 初始化或更新控制器测量输入
    pid2.Err = pid2.ref - pid2.Xin;                                         // 计算或清零当前控制误差
    pid2.Integral += pid2.Err;                                              // 累加输入电流误差
    if(pid2.Integral > RECTIFIER_CURRENT_INTEGRAL_LIMIT)                    // 限制正向积分状态
        pid2.Integral = RECTIFIER_CURRENT_INTEGRAL_LIMIT;                   // 最大积分补偿为0.15V
    else if(pid2.Integral < -RECTIFIER_CURRENT_INTEGRAL_LIMIT)              // 限制反向积分状态
        pid2.Integral = -RECTIFIER_CURRENT_INTEGRAL_LIMIT;                  // 最小积分补偿为-0.15V
    pid2.result = pid2.Kp * pid2.Err + pid2.Ki * pid2.Integral;             // 合成比例与积分电流补偿
    return pid2.result;                                                     // 返回输入电流PI控制输出
}

#if !RECTIFIER_ONLY_MODE                                                    // 单整流模式暂不编译逆变调制辅助算法
static void SVPWM_Calculate(float phase_a, float phase_b, float phase_c,     // 使用最大最小值共模注入法计算线性区SVPWM
                            float modulation_a, float modulation_b,
                            float modulation_c, float *duty_a,
                            float *duty_b, float *duty_c)
{
    float ref_a = modulation_a * sinf(phase_a);                             // 生成叠加A相平衡补偿后的基波参考
    float ref_b = modulation_b * sinf(phase_b);                             // 生成叠加B相平衡补偿后的基波参考
    float ref_c = modulation_c * sinf(phase_c);                             // 生成叠加C相平衡补偿后的基波参考
    float sv_max = ref_a;                                                    // 初始化三相参考最大值
    float sv_min = ref_a;                                                    // 初始化三相参考最小值
    float sv_offset;                                                         // 保存SVPWM零序共模偏置

    if(ref_b > sv_max) sv_max = ref_b;                                      // 更新三相参考最大值
    if(ref_c > sv_max) sv_max = ref_c;                                      // 更新三相参考最大值
    if(ref_b < sv_min) sv_min = ref_b;                                      // 更新三相参考最小值
    if(ref_c < sv_min) sv_min = ref_c;                                      // 更新三相参考最小值

    sv_offset = -0.5f * (sv_max + sv_min);                                  // 居中有效矢量并等分零矢量作用时间
    *duty_a = 0.5f + ref_a + sv_offset;                                     // 叠加共模偏置得到A相占空比
    *duty_b = 0.5f + ref_b + sv_offset;                                     // 叠加共模偏置得到B相占空比
    *duty_c = 0.5f + ref_c + sv_offset;                                     // 叠加共模偏置得到C相占空比

    if(*duty_a > 1.0f) *duty_a = 1.0f;                                     // 防止异常调制度导致A相比较值越界
    else if(*duty_a < 0.0f) *duty_a = 0.0f;                                // 防止异常调制度导致A相比较值越界
    if(*duty_b > 1.0f) *duty_b = 1.0f;                                     // 防止异常调制度导致B相比较值越界
    else if(*duty_b < 0.0f) *duty_b = 0.0f;                                // 防止异常调制度导致B相比较值越界
    if(*duty_c > 1.0f) *duty_c = 1.0f;                                     // 防止异常调制度导致C相比较值越界
    else if(*duty_c < 0.0f) *duty_c = 0.0f;                                // 防止异常调制度导致C相比较值越界
}

static void PhaseBalance_Calculate(float ua_rms, float ub_rms, float uc_rms,// 计算不改变公共调制度的三相独立幅值补偿
                                   float *trim_a, float *trim_b,
                                   float *trim_c)
{
    float phase_average = (ua_rms + ub_rms + uc_rms) * 0.3333333f;          // 以三相平均有效值作为平衡目标
    float trim_mean;                                                         // 保存三相补偿均值以强制零和
    float abs_a, abs_b, abs_c;                                              // 保存补偿绝对值
    float max_abs;                                                           // 保存三相最大补偿绝对值
    float trim_scale;                                                        // 同比例缩放因子，避免独立削顶破坏零和

    *trim_a = PHASE_BALANCE_KP * (phase_average - ua_rms);                  // 电压偏低的相增加调制度
    *trim_b = PHASE_BALANCE_KP * (phase_average - ub_rms);
    *trim_c = PHASE_BALANCE_KP * (phase_average - uc_rms);
    trim_mean = (*trim_a + *trim_b + *trim_c) * 0.3333333f;                 // 去除浮点计算及采样造成的公共分量
    *trim_a -= trim_mean;
    *trim_b -= trim_mean;
    *trim_c -= trim_mean;

    abs_a = (*trim_a >= 0.0f) ? *trim_a : -*trim_a;                         // 不依赖库函数计算绝对值，缩短ISR路径
    abs_b = (*trim_b >= 0.0f) ? *trim_b : -*trim_b;
    abs_c = (*trim_c >= 0.0f) ? *trim_c : -*trim_c;
    max_abs = abs_a;
    if(abs_b > max_abs) max_abs = abs_b;
    if(abs_c > max_abs) max_abs = abs_c;
    if(max_abs > PHASE_BALANCE_TRIM_LIMIT)                                  // 任一相超过1%时三相同比例收缩
    {
        trim_scale = PHASE_BALANCE_TRIM_LIMIT / max_abs;
        *trim_a *= trim_scale;
        *trim_b *= trim_scale;
        *trim_c *= trim_scale;
    }
}
#endif                                                                      // 结束逆变调制辅助算法临时屏蔽

