lululu-913/F280049_AC-DC-AC_26competition/controller.c
//******************* PIDa：三相输出电压环 *******************//
void PIDa_Init(void)                                                        // 初始化逆变输出电压控制参数
{
    pida.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pida.ref = 0;                                                           // 初始化控制器参考值
    pida.Err = 0;                                                           // 计算或清零当前控制误差
    pida.Err_last = 0;                                                      // 保存或清零上一拍误差
    pida.Kp = 0.025;                                                         // 设置比例系数
    pida.Ki = 0.010;                                                        // 设置积分系数
    pida.result = 0;                                                        // 计算或清零控制器当前输出
}

float PIDa_Cal(float u)                                                     // 计算逆变调制分母增量
{
    pida.Xin = u;                                                           // 初始化或更新控制器测量输入
    pida.Err = pida.Xin - pida.ref;                                         // 计算或清零当前控制误差
    pida.result = pida.Kp * (pida.Err - pida.Err_last) + pida.Ki * pida.Err; // 计算或清零控制器当前输出
    pida.Err_last = pida.Err;                                               // 保存或清零上一拍误差
    if(fabsf(pida.Err) > 0.01f) return pida.result;                         // 输出误差超出死区时返回调节增量
    return 0;                                                               // 误差位于死区时返回零增量
}

//******************* OLED显示 *******************//
void OLED_output(void)                                                      // 刷新设定值和测量值显示
{
    float oled_bus_value;                                                   // 保存本次刷新使用的实时母线电压快照
    float oled_out_value;                                                   // 保存本次刷新使用的三相输出电压快照
    float oled_pid_out_value;                                               // 保存本次刷新使用的母线外环累计电流幅值快照
    DINT;                                                                   // 短暂屏蔽ISR，保证三个32位浮点快照内部一致
    oled_bus_value = U_bus;                                                 // 获取实时母线电压供全部模式统一显示
    oled_out_value = U_av;                                                  // 获取实时三相输出等效相电压供全部模式统一显示
    oled_pid_out_value = pid_out;                                           // 获取母线外环累计输入电流峰值参考
    EINT;                                                                   // 快照完成后立即恢复控制中断
    if(oled_bus_value < 0.0f) oled_bus_value = 0.0f;                        // 钳除零点偏差产生的负母线显示值
    if(oled_out_value < 0.0f) oled_out_value = 0.0f;                        // 防止异常负数进入不支持负数的OLED浮点函数
    if(oled_bus_value > 99.0f) oled_bus_value = 99.0f;                      // 限制显示范围以避免超过固定字符区域
    if(oled_out_value > 99.0f) oled_out_value = 99.0f;                      // 限制输出显示范围以保持四行布局稳定
    if(oled_pid_out_value < 0.0f) oled_pid_out_value = 0.0f;                // 防止异常负值进入OLED显示
    if(oled_pid_out_value > 99.0f) oled_pid_out_value = 99.0f;              // 限制显示范围以保持第4行布局稳定

    switch(oled_row)                                                        // 每次调用只刷新一行以降低后台OLED通信占用
    {
        case 0:                                                             // 第0行分别显示整流命令、逆变命令、故障和调制分母
            OLED_ShowNum(1, 0, rectifier_enable, 1);                        // R后显示主动整流命令0或1
            OLED_ShowNum(4, 0, inverter_enable, 1);                         // I后显示逆变运行命令0或1
            OLED_ShowNum(7, 0, flag, 1);                                    // F后显示当前故障码0、1或2
            OLED_ShowFloat(10, 0, M, 3);                                    // M后显示逆变当前调制分母
            break;                                                          // 本次单行刷新结束

        case 1:                                                             // 第1行显示母线参考和母线实测值
            OLED_ShowFloat(3, 1, U_BUS_REF, 3);                             // BR后显示母线电压参考值
            OLED_ShowFloat(10, 1, oled_bus_value, 3);                       // B后显示当前母线实时采样值
            break;                                                          // 本次单行刷新结束

        case 2:                                                             // 第2行显示输出参考和输出实测值
            OLED_ShowFloat(3, 2, U_OUT_REF, 3);                             // OR后显示三相输出相电压参考值
            OLED_ShowFloat(10, 2, oled_out_value, 3);                       // O后显示当前三相输出等效相电压
            break;                                                          // 本次单行刷新结束

        default:                                                            // 第3行显示母线外环累计输入电流峰值参考
            OLED_ShowFloat(2, 3, oled_pid_out_value, 3);                    // P后显示当前pid_out
            break;                                                          // 本次单行刷新结束
    }

    oled_row++;                                                             // 下一次刷新下一行
    if(oled_row >= 4) oled_row = 0;                                         // 第3行完成后回到第0行循环刷新
}

//******************* 按键控制 *******************//
void KEY_Control(int key_value)                                             // 根据按键修改模式或参考值
{
    switch(key_value)                                                       // 根据按键码选择对应操作
    {
        case KEY1_PRESS:                                                    // KEY1固定增加三相逆变输出频率
            if(output_freq_hz < OUTPUT_FREQ_MAX_HZ)                         // 已到505Hz上限时保持不变
                output_freq_hz += OUTPUT_FREQ_STEP_HZ;                      // 每次扫描事件把输出频率增加1Hz
            break;                                                          // 结束当前按键分支

        case KEY2_PRESS:                                                    // KEY2固定减小三相逆变输出频率
            if(output_freq_hz > OUTPUT_FREQ_MIN_HZ)                         // 已到45Hz下限时保持不变
                output_freq_hz -= OUTPUT_FREQ_STEP_HZ;                      // 每次扫描事件把输出频率减小1Hz
            break;                                                          // 结束当前按键分支

        case KEY3_PRESS:                                                    // KEY3独立切换主动整流
            if(rectifier_enable == 0)                                       // 当前处于被动整流或整流Trip状态
            {
                if(U_bus < BUS_OVERVOLTAGE_LIMIT)                           // 母线已经退出过压区才允许重新确认启动
                {
                    system_fault = 0;                                       // 同时清除可能存在的预留全局故障锁存
                    rectifier_fault = 0;                                    // 清除整流局部故障锁存
#if !RECTIFIER_ONLY_MODE                                                    // 恢复AC-DC-AC模式时重新启用原逆变联锁
                    inverter_enable = 1;                                    // KEY3同时保证先提出逆变运行请求
#endif
                    rectifier_enable = 1;                                   // 单整流模式直接请求启动ePWM4/5
                    flag = 0;                                               // 清除旧故障显示
                }
            }
            else                                                            // 当前主动整流已经处于开启请求
            {
                rectifier_enable = 0;                                       // 撤销主动整流命令但不改变逆变命令
                rectifier_pwm_start_stage = 0;                              // 下次KEY3开启时重新执行CMPA预装
                PWM_TripRectifier();                                        // 本次按键处理当拍立即Trip ePWM4/5
            }
            break;                                                          // 结束当前按键分支

        case KEY4_PRESS:                                                    // KEY4增加整流母线目标电压
            if(U_BUS_REF < BUS_REF_MAX_VOLTAGE)                              // 已到65V上限时保持不变
            {
                U_BUS_REF += BUS_REF_STEP_VOLTAGE;                           // 每次扫描事件把母线目标增加0.5V
                if(U_BUS_REF > BUS_REF_MAX_VOLTAGE)
                    U_BUS_REF = BUS_REF_MAX_VOLTAGE;                         // 防止浮点步进越过上限
            }
            break;                                                          // 结束当前按键分支

        case KEY5_PRESS:                                                    // KEY5减小整流母线目标电压
            if(U_BUS_REF > BUS_REF_MIN_VOLTAGE)                              // 已到55V下限时保持不变
            {
                U_BUS_REF -= BUS_REF_STEP_VOLTAGE;                           // 每次扫描事件把母线目标减小0.5V
                if(U_BUS_REF < BUS_REF_MIN_VOLTAGE)
                    U_BUS_REF = BUS_REF_MIN_VOLTAGE;                         // 防止浮点步进越过下限
            }
            break;                                                          // 结束当前按键分支

        case KEY6_PRESS:                                                    // KEY6仍切换逆变命令，但单整流模式下不会产生PWM
            if(inverter_enable == 0)                                        // 当前逆变侧没有运行请求
            {
                if(U_bus < BUS_OVERVOLTAGE_LIMIT)                           // 母线已经退出过压区才接受新的逆变运行请求
                {
                    system_fault = 0;                                       // 清除可能存在的预留全局故障锁存
                    inverter_enable = 1;                                    // 请求逆变立即进入PWM预装和软启动流程
                }
            }
            else                                                            // 当前逆变侧已有运行请求
            {
#if !RECTIFIER_ONLY_MODE                                                    // 恢复AC-DC-AC模式时保留原整流先关断联锁
                if(rectifier_enable != 0)                                   // 主动整流仍有运行请求时必须先停止整流
                {
                    rectifier_enable = 0;                                   // 撤销主动整流命令
                    rectifier_pwm_start_stage = 0;                          // 清零整流PWM启动阶段
                    PWM_TripRectifier();                                    // 立即Trip ePWM4/5，确保整流先于逆变关断
                }
#endif
                inverter_enable = 0;                                        // 撤销逆变运行命令并由控制ISR执行软关断
            }
            break;                                                          // 结束当前按键分支

        case KEY_UNPRESS:                                                   // 无按键时不执行操作
        default:                                                            // 未定义按键码同样不执行操作
            break;                                                          // 结束当前按键分支
    }
    tag = ((rectifier_enable != 0) ? 2 : 0) + ((inverter_enable != 0) ? 1 : 0); // 组合状态仅供在线观察，不参与任一控制条件
}

char KEY_Scan(char key_mode)                                                // 仿照07192140工程读取六个低电平有效按键
{
    static int key3_latched = 0;                                            // KEY3按下后锁存一次，必须检测到松开才允许再次切换模式
    static int key6_latched = 0;                                            // KEY6按下后锁存一次，防止长按反复启停逆变
    if(KEY_H3 != 0) key3_latched = 0;                                       // KEY3松开后解除锁存，重新允许下一次按下事件
    if(KEY_H6 != 0) key6_latched = 0;                                       // KEY6松开后解除锁存，重新允许下一次按下事件

    if(key_mode == 0)                                                       // 当前调用使用模式0时依次检测六个按键
    {
        if((KEY_H3 == 0) && (key3_latched == 0))                            // KEY3本次按下尚未产生过模式切换事件
        {
            key3_latched = 1;                                               // 锁存本次按下，防止长按反复启停主动整流
            return KEY3_PRESS;                                              // 每次完整按下与松开过程只返回一次KEY3事件
        }
        if(KEY_H4 == 0) return KEY4_PRESS;                                  // 长按KEY4时保持每500ms重复一次升压事件
        if(KEY_H5 == 0) return KEY5_PRESS;                                  // 长按KEY5时保持每500ms重复一次降压事件
        if((KEY_H6 == 0) && (key6_latched == 0))                            // KEY6本次按下尚未产生过逆变模式切换
        {
            key6_latched = 1;                                               // 锁存本次KEY6按下直到检测到松开
            return KEY6_PRESS;                                              // 每次完整按下与松开过程只返回一次KEY6事件
        }
    }
    return KEY_UNPRESS;                                                     // 未检测到按键时返回未按下状态
}

void Init_KEY(void)                                                         // 配置目标板六个按键输入
{
    EALLOW;                                                                 // 允许访问受保护寄存器

    GPIO_setPadConfig(27, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(27, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO27 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(25, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(25, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO25 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(17, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(17, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setPadConfig(26, GPIO_PIN_TYPE_STD);                               // 配置对应按键GPIO为标准数字输入焊盘
    GPIO_setDirectionMode(26, GPIO_DIR_MODE_IN);                            // 配置对应按键GPIO为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO26 = 0;                                     // 使能对应按键GPIO内部上拉

    GPIO_setAnalogMode(16, GPIO_ANALOG_DISABLED);                           // 参考07192140工程关闭GPIO16模拟功能供KEY5使用
    GPIO_setPadConfig(16, GPIO_PIN_TYPE_STD);                               // 配置KEY5对应GPIO16为标准数字输入焊盘
    GPIO_setDirectionMode(16, GPIO_DIR_MODE_IN);                            // 配置KEY5对应GPIO16为输入方向
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;                                     // 使能KEY5对应GPIO16内部上拉

